bmourit/ArduinoCore-GD32/variants/GD32F303RE_GENERIC/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
    {PORTA_1,       USART1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_USART1_REMAP)},        /* USART1_RTS */
    {PORTA_12,      USART0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART0_RTS */
    {PORTB_14,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART2_RTS */
    {PORTB_14_ALT,  USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, USART2_PARTIAL_REMAP)},        /* USART2_RTS */
    {NC,    NC,    0}
};

const PinMap PinMap_UART_CTS[] = {
    {PORTA_0,       USART1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART1_CTS */
    {PORTA_11,      USART0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                  /* USART0_CTS */
    {PORTB_13,      USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_USART2_FULL_REMAP)},   /* USART2_CTS */
    {PORTB_13_ALT,  USART2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, USART2_PARTIAL_REMAP)},        /* USART2_CTS */
    {NC,    NC,    0}
};

/* SPI PinMap */
const PinMap PinMap_SPI_MOSI[] = {
    {PORTA_7,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_SPI0_REMAP)},            /* SPI0_MOSI */
    {PORTB_5,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                    /* SPI0_MOSI */
    {PORTB_5_ALT,   SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_MOSI */
    {PORTB_15,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_MOSI */
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PORTA_6,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_SPI0_REMAP)},            /* SPI0_MISO */
    {PORTB_4,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                    /* SPI0_MISO */
    {PORTB_4_ALT,   SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_MISO */
    {PORTB_14,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_MISO */
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
    {PORTA_5,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_SPI0_REMAP)},            /* SPI0_SCLK */
    {PORTB_3,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                    /* SPI0_SCLK */
    {PORTB_3_ALT,   SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_SCLK */
    {PORTB_13,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_SCLK */
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PORTA_4,       SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, DISABLE_SPI0_REMAP)},            /* SPI0_SSEL */
    {PORTA_15,      SPI0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, SPI0_REMAP)},                    /* SPI0_SSEL */
    {PORTA_15_ALT,  SPI2, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI2_SSEL */
    {PORTB_12,      SPI1, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_PU, REMAP_NONE)},                    /* SPI1_SSEL */
    {NC,    NC,    0}
};

/* CAN PinMap */
const PinMap PinMap_CAN_RD[] = {
    {PORTA_11, CAN0, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_FLOATING, REMAP_NONE)},                   /* CAN_RD */
    {PORTB_8,  CAN0, GD_PIN_DATA_REMAP(PIN_MODE_INPUT, PIN_MODE_INPUT_FLOATING, CAN_FULL_REMAP)},               /* CAN_RD */
    {NC,    NC,    0}
};

const PinMap PinMap_CAN_TD[] = {
    {PORTA_12, CAN0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_FLOATING, REMAP_NONE)},                   /* CAN0_TD */
    {PORTB_9,  CAN0, GD_PIN_DATA_REMAP(PIN_MODE_AF_PP, PIN_MODE_INPUT_FLOATING, CAN_FULL_REMAP)},               /* CAN0_TD */
    {NC,    NC,    0}
};

